app/views/pages/home.html.erb

          <strong>Breakfast Text Message</strong>
          <%=f.select 'breakfast_time' , Message::BREAKFAST,{:prompt => 'Breakfast @7 AM or Change'} %>
---
SELECT `messages`.* FROM `messages`

      </tr>
      <% for message in Message.find(:all, :conditions => ["category = ?",'Breakfast']) %>
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`category` = 'breakfast'