app/controllers/pages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`category` = 'breakfast'
---
  def home
    @title = "Home"
    @bfst_messages = Message.find_all_by_category ('breakfast')

INSERT INTO `receivers` (`name`, `phone_number`, `description`, `email`, `status`, `created_at`, `updated_at`, `time_zone`, `breakfast_time`, `lunch_time`, `snack_time`, `dinner_time`) VALUES ('jim', 7346747560, NULL, NULL, NULL, '2011-04-23 00:31:52', '2011-04-23 00:31:52', NULL, NULL, NULL, NULL, NULL)
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` IN (1, 2, 3)
INSERT INTO `messages_receivers` (`receiver_id`, `message_id`) VALUES (2, 1)
---
  def save_receiver_data
    @receiver = Receiver.new(params[:receiver])
    @receiver.messages << Message.find(params[:messages])
    @receiver.save