app/controllers/receivers_controller.rb

  def index
    @receivers = Receiver.all
---
SELECT `receivers`.* FROM `receivers`

  def show
    @receiver = Receiver.find(params[:id])
---
SELECT `receivers`.* FROM `receivers` WHERE `receivers`.`id` = 1 LIMIT 1

  def create
    @receiver = Receiver.new(params[:receiver])

    respond_to do |format|
      if @receiver.save
---
INSERT INTO `receivers` (`name`, `phone_number`, `description`, `email`, `status`, `created_at`, `updated_at`, `time_zone`, `breakfast_time`, `lunch_time`, `snack_time`, `dinner_time`) VALUES ('Swpana', 1122445577, 'AAAAAAAAAAAA', 'swap@gmail.com', '1', '2011-05-04 16:57:01', '2011-05-04 16:57:01', NULL, NULL, NULL, NULL, NULL)