app/controllers/users_controller.rb

SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `stories`.* FROM `stories` WHERE (`stories`.user_id = 1) LIMIT 30 OFFSET 0
---
  def show
    @user = User.find(params[:id])
   # @microposts = @user.microposts.paginate(:page => params[:page])
    @stories = @user.stories.paginate(:page => params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`, `admin`) VALUES ('mike', 'mike@me1.com', '2011-02-27 21:37:37', '2011-02-27 21:37:37', 'ff62e8bc33af89d9750596c685bb21210c30e7c5c801c51fe0bcc4ce2a25d85f', '43160c39d5431ed5aa94b25a0591ec39b60da71a5d94f2c7405512b6ef399eb4', 0)
---
  def create
    @user = User.new(params[:user])
    if @user.save